{
  "backend/main.mo": "Main Motoko actor for the LA Street Shine backend, defining booking management (submit, list, update status, delete), service info, contact info, and user profile CRUD with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, serving as a reference for the project's frontend structure and component responsibilities.",
  "frontend/index.css": "Root CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens including backgrounds, borders, charts, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the LA Street Shine site with full SEO meta tags, Open Graph, Twitter Card tags, Google Fonts (Montserrat + Rajdhani), and a root div for the React app.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with two routes: the home page (/) composing all section components, and the admin page (/admin).",
  "frontend/src/components/AboutUs.tsx": "About Us section component rendering the founders' origin story and four value cards (Precision, Passion, Family-Founded, Customer First) with brand-styled icons and a slogan callout.",
  "frontend/src/components/BeforeAfterGallery.tsx": "Empty file for the BeforeAfterGallery component, which has been removed from the app.",
  "frontend/src/components/ContactBooking.tsx": "Contact and booking section with a controlled form that collects customer info, service type, vehicle info, preferred date/time, and notes, then submits to the backend via the useSubmitBooking hook.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, social media links (Instagram, TikTok), quick navigation links with smooth scroll, and contact details including phone and location.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a background car image, headline, subheadline, CTA buttons to book or call, and a stats row highlighting mobile service, 5-star rating, and LA County coverage.",
  "frontend/src/components/Navbar.tsx": "Fixed top navigation bar with smooth-scroll links, a 'Call Now' button, scroll-based background change, and a responsive hamburger menu for mobile.",
  "frontend/src/components/ServicesSection.tsx": "Displays a grid of seven auto detailing service cards with icons, starting prices, and descriptions, highlighting the Full Detail Package as the most popular option.",
  "frontend/src/components/Testimonials.tsx": "Renders three customer review cards with star ratings, quotes, and service labels, plus a social proof bar at the bottom of the reviews section.",
  "frontend/src/components/WhyChooseUs.tsx": "Presents five reason cards explaining the company's value propositions (mobile service, premium products, affordability, reliability, 5-star experience) along with a referral and loyalty rewards section.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, login status, and helper flags to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including submitting, fetching, updating, and deleting bookings, as well as getting and updating service info.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining the LA Street Shine brand design system with OKLCH color tokens, utility classes for gradients, glass cards, glow effects, and button styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Password-protected admin dashboard page for managing bookings and service settings, with tabs for viewing/updating booking statuses and deleting bookings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom brand colors (black, blue, pink), fonts (Montserrat, Rajdhani), box shadows, animations, and integrating typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracking file (version 17) describing the LA Street Shine Auto Detailing luxury mobile detailing website, including architectural notes, existing features, known issues, and build requirements for all site sections."
}