{
  "backend/main.mo": "Main Motoko actor for the LA Street Shine backend, defining booking management (submit, retrieve, update status, delete), user profiles, service info, and contact info with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report confirming that the Hero.tsx CTA button smooth-scroll feature (targeting id='booking') is implemented, referencing the relevant files and test ID REQ-32.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of every frontend source file, serving as a reference index for the project's frontend components, hooks, pages, and config files.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, including colors for backgrounds, borders, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point with full SEO meta tags, Open Graph and Twitter Card tags, Google Fonts (Montserrat + Rajdhani), and the root div for the React app.",
  "frontend/src/App.tsx": "Root React app component using TanStack Router with two routes: the home page (/) composing all section components, and the admin page (/admin).",
  "frontend/src/components/AboutUs.tsx": "About Us section component displaying the founders' story narrative and four value cards (Precision, Passion, Family-Founded, Customer First) with brand-colored icons.",
  "frontend/src/components/BeforeAfterGallery.tsx": "Empty file — the BeforeAfterGallery component has no content and is not rendered in the current app.",
  "frontend/src/components/ContactBooking.tsx": "Contact and booking form section with id='booking' on the root element for smooth-scroll targeting, including field validation, service selection, and error/success states via the useSubmitBooking hook.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, social media links (Instagram, TikTok), quick navigation links with smooth scroll, and contact details including phone and location.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a background car image, headline, subheadline, CTA buttons to book or call, and a stats row highlighting mobile service, 5-star rating, and LA County coverage.",
  "frontend/src/components/Navbar.tsx": "Fixed top navigation bar with smooth-scroll links, a call CTA button, scroll-based background change, and a responsive hamburger menu for mobile.",
  "frontend/src/components/ServicesSection.tsx": "Displays a grid of seven auto detailing service cards with icons, starting prices, and descriptions, highlighting the Full Detail Package as the most popular option.",
  "frontend/src/components/Testimonials.tsx": "Shows three customer review cards with star ratings, quotes, and service labels, plus a social proof bar at the bottom of the section.",
  "frontend/src/components/WhyChooseUs.tsx": "Presents five reason cards explaining the company's value proposition (mobile service, premium products, affordability, reliability, satisfaction) along with a referral and loyalty rewards section.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flows, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including submitting/fetching/updating/deleting bookings and getting/updating service info.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining the LA Street Shine brand design system with OKLCH color tokens, gradient utilities, glass-card effects, and glow styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with password-gated access that allows viewing/managing bookings and updating service info via tabs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom brand colors (black, blue, pink), fonts (Montserrat, Rajdhani), shadows, animations, and integrating typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracker (version 23) documenting the LA Street Shine Auto Detailing website build, including architectural notes, known issues (booking form text visibility), and a list of existing implemented features."
}